#!/usr/bin/env node
import readlineSync from 'readline-sync';

//Камень-Ножницы-Бумага
function playGame() {
const pc = Math.random();

console.log('-------------------------------------------\n           КАМЕНЬ-НОЖНИЦЫ-БУМАГА\n-------------------------------------------');

console.log(`Значение для проверки честной игры: ${pc.toFixed(4)}\n-------------------------------------------`);

const user = readlineSync.question('Ваш выбор: ');

//Если игрок выбрал 'Камень'.
if (user[0].toLowerCase() === 'к' && pc < 0.3) {
console.log('Компьютер выкинул: Ножницы\n-------------------------------------------\nРезультат: Вы победили\n-------------------------------------------');
}
else if (user[0].toLowerCase() === 'к' &&  pc < 0.6) {
console.log('Компьютер выкинул: Камень\n-------------------------------------------\nРезультат: Ничья\n-------------------------------------------');
}
else if (user[0].toLowerCase() === 'к' &&  pc > 0.6) {
console.log('Компьютер выкинул: бумагу\n-------------------------------------------\nРезультат: Вы проиграли\n-------------------------------------------');
}

//Если игрок выбрал 'Ножницы'.
if (user[0].toLowerCase() === 'н' && pc < 0.3) {
console.log('Компьютер выкинул: Бумагу\n\nРезультат: Вы победили\n-------------------------------------------');
}
else if (user[0].toLowerCase() === 'н' &&  pc < 0.6) {
console.log('Компьютер выкинул: Ножницы\n\nРезультат: Ничья\n-------------------------------------------');
}
else if (user[0].toLowerCase() === 'н' &&  pc > 0.6) {
console.log('Компьютер выкинул: Камень\n\nРезультат: Вы проиграли\n-------------------------------------------');
}

//Если игрок выбрал 'Бумага'.
if (user[0].toLowerCase() === 'б' && pc < 0.3) {
console.log('Компьютер выкинул: Камень\n\nРезультат: Вы победили\n-------------------------------------------');
}
else if (user[0].toLowerCase() === 'б' &&  pc < 0.6) {
console.log('Компьютер выкинул: Бумага\n\nРезультат: Ничья\n-------------------------------------------');
}
else if (user[0].toLowerCase() === 'б' &&  pc > 0.6) {
console.log('Компьютер выкинул: Ножницы\n\nРезультат: Вы проиграли\n-------------------------------------------');
}
};

// Демонстрация
playGame();


